{"_id":1,"title":"Users Relieved as Binance-Voyager Deal Approved","author":"John Doe","date":"2023-04-21","content":"The Voyager bankruptcy case could finally come to a resolution, and users are breathing a collective sigh of relief.  \r\n\r\nIn recent events, the US government has approved the deal between Binance.US and Voyager, despite their initial opposition. To Voyager users, the deal brings hope that they would get their funds back from the bankrupt exchange.  \r\n\r\nThe Voyager Official Committee of Unsecured Creditors (UCC) announced the resolution on Wednesday, April 19. They added that the acquisition plan would move forward shortly. \r\n\r\n“Voyager and the UCC are working with Binance.US to move forward as quickly as possible once this stipulation is approved by the District Court,” they added. The Committee did not disclose the exact details of the deal. "}
{"_id":2,"title":"What’s next for EU’s crypto industry as European Parliament passes MiCA?","author":"Veronika Rinecker","date":"2023-04-20","content":"On April 20, the European Parliament voted to pass the Markets in Crypto-Assets (MiCA) regulation, the European Union’s main legislative proposal to oversee the crypto industry in its member countries. The MiCA regulation is a significant development for the crypto industry in the European Union. Prior to MiCA, crypto companies had to comply with 27 different regulatory frameworks across the EU member states, with Germany or France being costly and burdensome, for example.Under MiCA, however, EU-wide regulations will apply, allowing companies to operate throughout the entire EU crypto market with a MiCA license granted in one country. This will increase the competitiveness of EU startups and may result in them gaining market share from unregulated competitors."}
{"_id":3,"title":"DeFi driving zkSync growth as 1inch deploys on Ethereum layer-2 scaling platform","author":"Grace Ema","date":"2023-04-19","content":" 1inch Network is the latest decentralized Finance protocol to deploy on Ethereum layer-2 scaling platform zkSync Era.Decentralized finance protocol 1inch has deployed its aggregation and limit order protocols on Ethereum layer-2 scaling solution zkSync Era to tap into faster and cheaper transactions.1inch Network is the latest of a host of Ethereum-based platforms and services deploying on the zero-knowledge proof (zk-proof) based scaling platform. Uniswap, SushiSwap, Maker and Curve Finance are also preparing to launch on the zk-proof roll-up zkSync Era.1inch Network co-founder Sergej Kunz highlighted the promise of the layer-2 solution as his platform joins a handful of first-movers to integrate with the zk-proof powered protocol"}
